[Rainmeter]
; 每两个小时刷新一次 7200000
Update=2000
AccurateText=1

[Metadata]
Name=NewCountdown
Author=jin
Information=一个年、月倒计时
Version=1.0.1
License=Creative Commons Attribution - Non - Commercial - Share Alike 3.0

[Variables]
; 样式尺寸
height=180
width=80
fontColor1=71, 71, 71, 200
fontColor2=51, 51, 51, 220
; fontFace1=HarmonyOS Sans SC
fontFace1=Resource Han Rounded CN
bgFillColor=240,240,240,255
; 年进度shape渐变色
myFillGradient1=90 | 255, 133, 255, 255 ; 0 |255, 153, 255, 255 ; 0.3 | 255, 194, 255,255 ; 1
; 月进度shape渐变色
myFillGradient2=90 | 10, 255, 255, 255 ; 0 |92, 255, 255, 255 ; 0.3 | 153, 255, 255,255 ; 1
; 年总天数(365 || 366)
yearTotalDays=365
; 2月天数(28 || 29)
februaryTotalDays=28
; 年总天数(28 || 29 || 30 || 31)
monthTotalDays=31
yearUnit=天
monthUnit=天


;======================================

; 获取今年年份
[MeasureYearNow]
Measure=Time
Format=%G
UpdateDivider=-1

; 计算今年是否是闰年, 修改2月天数(29)和年总天数(366)
[MeasureIsLearYear]
Measure=Calc
Formula=0
IfCondition= ((MeasureYearNow % 4 = 0) && (MeasureYearNow % 100 <> 0)) || (MeasureYearNow % 400 = 0)
IfTrueAction=[!SetVariable yearTotalDays 366][!SetVariable februaryTotalDays 29]
UpdateDivider=-1

; 获取今天是一年中的第几天: 1~366
[MeasureDayOfYear]
Measure=Time
Format=%j

; 获取当前小时
[MeasureDayHourNow]
Measure=Time
Format=%H

; 获取今天日期
[MeasureDayNow]
Measure=Time
Format=%e
UpdateDivider=5

; 获取月份
[MeasureMonthNow]
Measure=Time
Format=%m
UpdateDivider=5

; 根据不同月份修改当月总天数monthTotalDays
[MeasureFixMonthTotalDays]
Measure=Calc
Formula=0
; 处理闰年
IfCondition=(MeasureMonthNow = 02)
IfTrueAction=[!SetVariable monthTotalDays #februaryTotalDays#]
IfCondition2=(MeasureMonthNow = 04) || (MeasureMonthNow = 06) || (MeasureMonthNow = 09) || (MeasureMonthNow = 11)
IfTrueAction2=[!SetVariable monthTotalDays 30]

; 一个循环, 输出数字让进度条计算后动起来, 注释掉, 需要的时候把[MeasureLoop1]值传给shape中绘制即可。
; [MeasureLoop1]
; Measure=Loop
; StartValue=1
; EndValue=60
; Increment=1
; LoopCount=0
; InvertMeasure=0
; IfCondition=MeasureLoop1 = 60
; IfTrueAction=[!SetOption MeasureLoop1 InvertMeasure 1]
; IfCondition2=MeasureLoop1 = 1
; IfTrueAction2=[!SetOption MeasureLoop1 InvertMeasure 0]
; Paused=1

; =================年倒计时================
; ========================================

; 计算今年剩余天数/小时
[MeasureYearDaysRemaining]
Measure=Calc
Formula=#yearTotalDays#-MeasureDayOfYear
; 处理最后一天。计算小时
IfCondition=MeasureYearDaysRemaining = 0
IfTrueAction=[!SetOption MeasureYearDaysRemaining Formula (24-MeasureDayHourNow)][!SetVariable yearUnit "小时"]
; 设置动态变量, 不然yearTotalDays变量只会拿初始值, 后续相关使用动态变量的地方一样设置。
DynamicVariables=1

; 计算今年过去的时间占今年总时间的百分比, 通过百分比计算坐标偏移量
[MeasureYearPercentFormat]
Measure=Calc
Formula=#height#*Round(MeasureDayOfYear/#yearTotalDays#, 2)
DynamicVariables=1

; 显示样式
[MeterYearShape1]
Meter=Shape
MyFillGradient=#myFillGradient1#
Shape=Rectangle 0,0,(#width#),(#height#),40,40 | StrokeWidth 0 | Fill Color #bgFillColor#
Shape2=Rectangle 0,0,#width#,#height#,40,40 | StrokeWidth 0 | Fill LinearGradient MyFillGradient | Scale 0.9,0.95
Shape3=Path MyPath3
MyPath3=0,#height# | LineTo 0,[MeasureYearPercentFormat] | CurveTo #width#,[MeasureYearPercentFormat],10,([MeasureYearPercentFormat]-25),70,[MeasureYearPercentFormat] | LineTo #width#,#height# | LineTo 0,#height#
Shape4=Combine Shape2 | Intersect Shape3
AntiAlias=1
DynamicVariables=1

[MeterYearString1]
Meter=String
MeasureName=MeasureYearNow
X=(#width#/2)
Y=(#height#/2-40)
FontSize=10
FontColor=#fontColor1#
FontFace=#fontFace1#
Text="%1年剩"
AntiAlias=1
StringAlign=Center

[MeterYearString2]
Meter=String
MeasureName=MeasureYearDaysRemaining
X=(#width#/2)
Y=(#height#/2)
FontSize=25
FontColor=#fontColor2#
FontFace=#fontFace1#
Text=%1
AntiAlias=1
StringAlign=CenterCenter

[MeterYearString3]
Meter=String
X=(#width#/2)
Y=20r
FontSize=12
FontColor=#fontColor1#
FontFace=#fontFace1#
Text=#yearUnit#
AntiAlias=1
StringAlign=Center
DynamicVariables=1

; =================月倒计时================
; ========================================

; 计算月剩余天数/小时
[MeasureMonthDaysRemaining]
Measure=Calc
Formula=#monthTotalDays#-MeasureDayNow
IfCondition=MeasureMonthDaysRemaining = 0
IfTrueAction=[!SetOption MeasureMonthDaysRemaining Formula (24-MeasureDayHourNow)][!SetVariable monthUnit "小时"]
DynamicVariables=1

; 计算当月过去的天数占当月总天数的百分比, 通过百分比计算坐标偏移量
[MeasureMonthPercentFormat]
Measure=Calc
Formula=#height#*Round((MeasureDayNow/#monthTotalDays#), 2)
DynamicVariables=1

; ===================显示样式
[MeterMonthShape1]
Meter=Shape
X=(#width#+10)
MyFillGradient=#myFillGradient2#
Shape=Rectangle 0,0,(#width#),(#height#),40,40 | StrokeWidth 0 | Fill Color #bgFillColor#
Shape2=Rectangle 0,0,#width#,#height#,40,40 | StrokeWidth 0 | Fill LinearGradient MyFillGradient | Scale 0.9,0.95
Shape3=Path MyPath3
MyPath3=0,#height# | LineTo 0,[MeasureMonthPercentFormat] | CurveTo #width#,[MeasureMonthPercentFormat],10,([MeasureMonthPercentFormat]-25),70,[MeasureMonthPercentFormat] | LineTo #width#,#height# | LineTo 0,#height#
Shape4=Combine Shape2 | Intersect Shape3
AntiAlias=1
DynamicVariables=1

[MeterMonthString1]
Meter=String
MeasureName=MeasureMonthNow
MeterStyle=MeterYearString1
X=(#width#*1.5+10)
Text="%1月剩"

[MeterMonthString2]
Meter=String
MeasureName=MeasureMonthDaysRemaining
MeterStyle=MeterYearString2
X=(#width#*1.5+10)
Text=%1

[MeterMonthString3]
Meter=String
MeterStyle=MeterYearString3
X=(#width#*1.5+10)
Text=#monthUnit#